0.1.0/tutorials/electromagnetics/mhd/hartmann/system/fvSolution
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSolution;
}

solvers
{
  p
  {
    solver          PCG;
    preconditioner  DIC;
    tolerance       1e-06;
    relTol          0;
  }
  pB
  {
    $p;
    tolerance       1e-05;
    relTol          0;
  }
  "(U|B)"
  {
    solver          smoothSolver;
    smoother        symGaussSeidel;
    tolerance       1e-05;
    relTol          0;
  }
}
PISO
{
  nCorrectors     3;
  nNonOrthogonalCorrectors 0;
}
BPISO
{
  nCorrectors     3;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
